// Task-2-1-ru.c : Этот файл содержит функцию 'main'. Выполнение программы начинается и заканчивается здесь.
//
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>
#include <locale.h>

int main(int argc, char* args[])
{
    unsigned int a; // Нижняя граница безопасных показаний
    unsigned int b; // Верхняя граница безопасных показаний
    unsigned int n; // Показания уровня помех
    unsigned int c = 0;  // Счётчик безопасных показаний
    unsigned int d = 0;  // Перемная для сохранения длины участка, где показания безопасны
    unsigned int m; // локальный максимум длины участка, где показания безопасны.
    unsigned int max_len = 0;  // максимальная длиная участка, где показания безопасны. Окончательный ответ.
    // Установка русской локали для терминала Windows 11
    system("chcp 65001 >nul");// 1-й способ. Выплнить внешнюю команду.
    setlocale(LC_ALL, "russian.65001"); // 2 - й способ. Вызов библиотечной функции.
    // Ввод данных
    printf("Введите границы безопасности показаний\r\n");
    printf("Нижняя граница: ");
    scanf("%u",&a);
    printf("Верхнияя граница: ");
    scanf("%u", &b);
    printf("Введите показания датчика орбитальной станции\r\n");
    printf("0 - конец ввод данных\r\n");
    scanf("%u",&n);  // Ввод первого значения уровня помех
    while (n != 0)  // Ввод показаний до момента, когда значение не равно 0.
    {
        if ((n >= a) && (n <= b))  // условие безопасности показаний
        {
            c++;  // Увеличение счётчика безопасных показаний
        }
        else
        {
            d = c;  // Если показания опасны, запомнить количество безопасных
            c = 0;  // и сбросить счётчик.
        }
        // определить максимальную длину участка,
        // где показания безопасны. Если был сброс счётчика
        // (прервана цепочка безопасных данных),то максимальной длиной
        // будет старое значение счётчика (перемменая "d").
        // В противном случае - текущее (новое) значение счётчика
        // (переменное "c"). Промежуточный результат
        if (d > c)
        {
            m = d;
        }
        else
        {
            m = c;
        }
        // Максимальная длина участка, где показания безопасны.
        // Окончательный ответ.
        if (m > max_len)
        {
            max_len = m;
        }
        scanf("%u",&n);  // ввод следющей порции данных
    }
    // Вывод информации на экран.
    printf("Длина интервала, где все показания безопасны: %u\r\n", max_len);
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getchar();
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», чтобы добавить существующие файлы кода в проект